libretiny-eu/libretiny/boards/wr2l/variant.h
/* This file was auto-generated from wr2l.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         5
#define NUM_DIGITAL_PINS   5
#define NUM_ANALOG_INPUTS  1
#define NUM_ANALOG_OUTPUTS 0

// Analog pins
// -----------
#define PIN_A0 3u     // PA_19
#define A0     PIN_A0

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 0

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 0

// Pin function macros
// -------------------
#define PIN_FUNCTION_ADC1 3u // PA_19
#define PIN_FUNCTION_CS0  3u // PA_19
#define PIN_FUNCTION_CS1  3u // PA_19
#define PIN_FUNCTION_CTS0 3u // PA_19
#define PIN_FUNCTION_PA05 2u // PA_5
#define PIN_FUNCTION_PA12 4u // PA_12
#define PIN_FUNCTION_PA14 1u // PA_14
#define PIN_FUNCTION_PA15 0u // PA_15
#define PIN_FUNCTION_PA19 3u // PA_19
#define PIN_FUNCTION_PWM0 1u // PA_14
#define PIN_FUNCTION_PWM1 0u // PA_15
#define PIN_FUNCTION_PWM3 4u // PA_12
#define PIN_FUNCTION_PWM4 2u // PA_5
#define PIN_FUNCTION_SDA0 3u // PA_19
